Repository: miyako/4d-tips-sql-code-samples
Catalog: Resources/*.lproj/4D_SQLFR.xlf
Languages: french

# Main_Using4DCode
source: Using 4D code
french: Utiliser le code 4D

# Main_UsingSQLCode
source: Using SQL code
french: Utiliser le code SQL

# Main_UsingODBC
source: Using ODBC
french: Utiliser ODBC

# Main_UsingQueryBySQL
source: Using "Query by SQL"
french: Utiliser "Chercher par SQL"

# Main_UsingDynamicSQL
source: Using Dynamic SQL
french: Utiliser SQL Dynamique

# Main_Trace
source: Trace the code
french: Tracer le code

# Menu_DemoSQL
source: Demo SQL
french: Démo SQL

# Menu_ShowSamples
source: Show Sampples…
french: Montrer les exemples…

# Main_QueryMode
source: Query Mode
french: Mode de requète

# Main_Queries
source: Queries
french: Requètes

# Main_ErrorTracking
source: Error tracking
french: Recherche d'erreurs

# Main_DataDéfinitionLanguage
source: Data Definition Language
french: Définition des données (DDL)

# Main_ExternalConnections
source: External connections
french: Connexions externes

# Main_GroupOfArrays
source: Group of arrays
french: Tableaux groupés

# Main_Years
source: Years
french: Années

# Main_Titles
source: Titles
french: Titres

# Main_Directors
source: Directors
french: Réalisateurs

# Main_Media
source: Media
french: Média

# Main_TicketsSold
source: Tickets Sold
french: Billets vendus

# Main_NumberOfActors
source: Number of actors
french: Nombre d'acteurs

# Main_Years_1
source: Years (aMovieYear)
french: Années (aMovieYear)

# Main_Titles_2
source: Titles (aTitles)
french: Titre (aTitles)

# Main_Directors_3
source: Directors (aDirectors)
french: Réalisateurs (aDirectors)

# Main_Media_4
source: Media (aMedia)
french: Média (aMedia)

# Main_TicketsSold_5
source: Tickets Sold (aSoldTickets)
french: Billets vendus (aSoldTickets)

# Main_NumberOfActors_6
source: Number of actors (aNrActors)
french: Nombre d'acteurs (aNrActors)

# Main_SQLQueryResultsInVariables
source: SQL query results in variables
french: Requètes SQL vers variables

# Main_WHEREClause
source: WHERE clause
french: Clause WHERE

# Main_SQLQueryResultsInArrays
source: SQL query results in arrays
french: Requètes SQL vers tableaux

# Main_UsingCAST
source: Using CAST
french: Utilisation de CAST

# Main_ORDERBYClause
source: ORDER BY clause
french: Clause ORDER BY

# Main_GROUPBYClause
source: GROUP BY clause
french: Clause GROUP BY

# Main_UsingStatisticalFunctions
source: Using Statistical functions
french: Utilisation de requètes statistiques

# Main_HAVINGClause
source: HAVING clause
french: Clause HAVING

# Main_Calling4DMethods
source: Calling 4D methods
french: Appel de méthode 4D

# Main_Joins
source: Joins
french: Jointures

# Main_UsingAliases
source: Using Aliases
french: Utilisation d'alias

# Main_Subqueries
source: Subqueries
french: Sous requètes

# Main_DebuggingSQLCode
source: Debugging SQL code
french: Debugger le code SQL

# Main_UsingONERRCALL
source: Using ON ERR CALL
french: Utiliser "Appeler sur erreur"

# Main_ConnectToORACLE
source: Connect to ORACLE
french: Connexion à ORACLE

# Main_ConnectTo4D
source: Connect to 4D
french: Connexion à 4D

# Main_Alerts_TheMoviesTableContains1Movies
source: The 'movies' table contains <1> movies.
french: La table "movies" contient <1> enregistrements.

# Main_Alerts_TheMoviesTableContains1MoviesReleased
source: The 'movies' table contains <1> movies released in 1960 of after.
french: La table "movies" contient <1> films sortis en 1960 ou après.

# Main_Alerts_TicketsSold
source: Tickets sold: Minimum: <1> Maximum: <2> Average: <3> Total: <4>
french: Billets vendus : Minimum : <1> Maximum : <2> Moyenne : <3> Total : <4>

# Main_Alerts_NotApplicable
source: Not applicable
french: Non applicable
